examples/c/fio_output_hs.log
hotspot: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.36
Starting 32 processes

fio: terminating on signal 2

hotspot: (groupid=0, jobs=32): err= 0: pid=36658: Wed Dec  4 06:54:20 2024
  read: IOPS=1707k, BW=6669MiB/s (6993MB/s)(633GiB/97194msec)
    slat (nsec): min=756, max=40126k, avg=4235.09, stdev=9264.85
    clat (nsec): min=348, max=472561, avg=589.98, stdev=200.57
     lat (nsec): min=1168, max=40136k, avg=4825.07, stdev=9295.25
    clat percentiles (nsec):
     |  1.00th=[  434],  5.00th=[  442], 10.00th=[  474], 20.00th=[  486],
     | 30.00th=[  498], 40.00th=[  556], 50.00th=[  580], 60.00th=[  588],
     | 70.00th=[  612], 80.00th=[  684], 90.00th=[  740], 95.00th=[  772],
     | 99.00th=[  956], 99.50th=[ 1064], 99.90th=[ 1992], 99.95th=[ 4192],
     | 99.99th=[ 6432]
   bw (  MiB/s): min=  521, max= 8299, per=100.00%, avg=6780.01, stdev=30.75, samples=6112
   iops        : min=133542, max=2124720, avg=1735682.91, stdev=7871.32, samples=6112
  write: IOPS=427k, BW=1667MiB/s (1748MB/s)(158GiB/97194msec); 0 zone resets
    slat (nsec): min=1047, max=41363k, avg=51644.50, stdev=57232.93
    clat (nsec): min=370, max=282926, avg=652.83, stdev=226.23
     lat (nsec): min=1519, max=41370k, avg=52297.33, stdev=57263.13
    clat percentiles (nsec):
     |  1.00th=[  458],  5.00th=[  466], 10.00th=[  470], 20.00th=[  502],
     | 30.00th=[  540], 40.00th=[  604], 50.00th=[  644], 60.00th=[  684],
     | 70.00th=[  716], 80.00th=[  756], 90.00th=[  828], 95.00th=[  892],
     | 99.00th=[ 1112], 99.50th=[ 1224], 99.90th=[ 2640], 99.95th=[ 4640],
     | 99.99th=[ 6752]
   bw (  MiB/s): min=  131, max= 2070, per=100.00%, avg=1695.03, stdev= 7.67, samples=6112
   iops        : min=33610, max=530010, avg=433927.65, stdev=1963.89, samples=6112
  lat (nsec)   : 500=29.92%, 750=58.76%, 1000=10.32%
  lat (usec)   : 2=0.89%, 4=0.05%, 10=0.06%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=5.82%, sys=90.88%, ctx=1218011, majf=0, minf=1149
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=165927391,41482757,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6669MiB/s (6993MB/s), 6669MiB/s-6669MiB/s (6993MB/s-6993MB/s), io=633GiB (680GB), run=97194-97194msec
  WRITE: bw=1667MiB/s (1748MB/s), 1667MiB/s-1667MiB/s (1748MB/s-1748MB/s), io=158GiB (170GB), run=97194-97194msec

Disk stats (read/write):
  nvme0n1: ios=839102/4488685, sectors=6712872/94089944, merge=0/572, ticks=85277/5547241, in_queue=5632518, util=33.70%